In [2]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [3]:
cast = pd.read_csv('cast.csv', index_col=None)
cast.head()

                  title    year      name   type                character     n
0        Closet Monster  2015.0  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985.0    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017.0   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015.0   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015.0   $hutter  actor  1988 Opera House Patron   NaN

In [11]:
release_dates = pd.read_csv('release_dates.csv', index_col=None,
                                      parse_dates=['date'], infer_datetime_format=True)
release_dates.head(50)

                                 title  year       country       date
0                #73, Shaanthi Nivaasa  2007         India 2007-06-15
1                              #Beings  2015       Romania 2015-01-29
2                            #Declimax  2018   Netherlands 2018-01-21
3               #Ewankosau saranghaeyo  2015   Philippines 2015-01-21
4                              #Horror  2015           USA 2015-11-20
5                              #Horror  2015            UK 2016-05-16
6                        #Lucky Number  2015           USA 2015-09-01
7                   #Nerealnaya lyubov  2014        Russia 2014-02-13
8                       #Pellichoopulu  2016         India 2016-07-29
9                                #Roxy  2017           USA 2017-03-01
10                          #Screamers  2016           USA 2017-10-31
11                     #Slaughterhouse  2016           USA 2016-10-01
12                              #Stuck  2014        Turkey 2014-07-01
13                              #Stuck  2014           USA 2014-10-10
14                      #TheFaustFlick  2017           USA 2017-11-03
15                        #WszystkoGra  2016        Poland 2016-05-06
16                                  #Y  2014   Philippines 2014-12-10
17                   #garotas: O Filme  2015        Brazil 2015-11-12
18                    #murderchallenge  2017           USA 2017-10-31
19                                   $  1971  West Germany 1972-02-17
20                                   $  1971       Denmark 1972-03-10
21                                   $  1971        Sweden 1972-03-27
22                                   $  1971       Finland 1972-05-05
23                                   $  1971         Italy 1972-09-12
24                                   $  1971        France 1972-09-13
25                                   $  1971      Portugal 1972-09-14
26                                   $  1971         Japan 1972-10-07
27                                   $  1971        Mexico 1972-10-18
28                                   $  1971       Ireland 1973-01-26
29                                   $  1971        Turkey 1973-11-19
30                           $10 Raise  1935           USA 1935-05-04
31                   $1000 a Touchdown  1939           USA 1939-10-04
32                       $5,000 Reward  1918           USA 1918-05-25
33                      $50,000 Reward  1924            UK 1926-01-25
34  $50K and a Call Girl: A Love Story  2014           USA 2014-01-14
35                               $9.99  2008        France 2009-04-29
36                               $9.99  2008        Russia 2009-08-13
37                               $9.99  2008     Australia 2009-09-17
38                               $9.99  2008      Portugal 2010-01-07
39                            $kumbagz  2015           USA 2015-03-02
40                             $windle  2002   South Korea 2004-04-12
41                                 &Me  2013   Netherlands 2013-03-14
42                                 '38  1986  West Germany 1987-04-23
43                                 '38  1986  East Germany 1988-03-11
44                             '49-'17  1917           USA 1917-10-15
45                                 '71  2014       Ireland 2014-10-10
46                                 '71  2014        Sweden 2014-10-10
47                                 '71  2014            UK 2014-10-10
48                                 '71  2014        Greece 2014-10-16
49                                 '71  2014        France 2014-11-05

In [20]:
release_dates['month'] = release_dates['date'].dt.month
release_dates['year'] = release_dates['date'].dt.year
release_dates

                          title  year      country       date  month
0         #73, Shaanthi Nivaasa  2007        India 2007-06-15      6
1                       #Beings  2015      Romania 2015-01-29      1
2                     #Declimax  2018  Netherlands 2018-01-21      1
3        #Ewankosau saranghaeyo  2015  Philippines 2015-01-21      1
4                       #Horror  2015          USA 2015-11-20     11
...                         ...   ...          ...        ...    ...
452651  xXx: State of the Union  2005          USA 2005-04-29      4
452652  xXx: State of the Union  2005       Poland 2005-06-03      6
452653  xXx: State of the Union  2005       Turkey 2005-06-03      6
452654  xXx: State of the Union  2005        China 2005-06-17      6
452655  xXx: State of the Union  2005       Greece 2005-06-24      6

[452656 rows x 5 columns]

### Count the number of movies with "Christmas" in their title for each month, that is released are the USA.

In [27]:

q = release_dates[release_dates["title"].str.contains("Christmas")]

q = q[q["country"].str.contains("USA")]
q[['month','country','title']].groupby(['month','country'], as_index=False).count()

    month country  title
0       1     USA      2
1       2     USA      2
2       4     USA      1
3       5     USA      1
4       6     USA      1
5       7     USA      1
6       8     USA      2
7       9     USA      2
8      10     USA     14
9      11     USA     38
10     12     USA     47

                            title    year  ...           character     n
1599       Office Christmas Party  2016.0  ...       Office Worker   NaN
1600       Office Christmas Party  2016.0  ...       Party Crasher   NaN
3542     A Merry Little Christmas  2006.0  ...     Crowdy Rowdy #1   NaN
3736     A Modern Christmas Story  2017.0  ...  Rene (Wounded Man)   NaN
3896     Operation Christmas List  2016.0  ...                 Moe   9.0
...                           ...     ...  ...                 ...   ...
2336320          A Christmas Star  2015.0  ...      Factory Worker   NaN
2336723       Renfroe's Christmas  1997.0  ...        School Bully  15.0
2337305           Happy Christmas  2014.0  ...         Party Guest  31.0
2337478   Beverly Hills Christmas  2015.0  ...          Patron #41  73.0
2337656       A Doggone Christmas  2016.0  ...             Soldier   NaN

[3690 rows x 6 columns]

### Count the number of movies with "Christmas" in their title for each month, that are released in Canada.

### Count the number of movies in which the titles start with "The Hobbit" for each month, that are released in the USA.

### Count the number of movies with "Romance" in their title for **each day of the week**, that are released in the USA.

### Count the number of movies with "Action" in their title for **each day of the week**, that are released in the USA.

### On which date was each Judi Dench movie from the 1990s released in the USA?

### In which months do films with the actress Judi Dench tend to be released in the USA?

### In which months do films with the actor Tom Cruise tend to be released in the USA?